// PrototypeFunction.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

double getSum(double x1, double x2);// обхявляем проотип функции
/* многострочный комментарий
    можно написать:
    double getSum(double, double);
*/

int main()
{
    double x, y;
    cout << "Input first value: " << endl;
    cin >> x;
    cout << "Input second value: " << endl;
    cin >> y;
    cout<<"Sum of " << x <<" and "<<y <<": " << getSum(x, y) << endl;
}

double getSum(double x1, double x2) {
    return x1 + x2;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
